# FailureMessage Properties

---
The FailureMessage type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
FailureMessage Class
Autodesk.Revit.DB Namespace